insert into animals(name)
values
('Данный питомник');

insert into type_animals (name, animals_id)
values
('Домашние животные', 1),
('Вьючные животные', 1);

insert into view_animals (name, type_animals_id)
values
('Собака', 1),
('Кошка', 1),
('Хомяк', 1),
('Лошадь', 2),
('Верблюд', 2),
('Осел', 2);

insert into all_animals (name, date_of_birth, view_animals_id)
values 
('Жучка', '2023-05-05', 1),
('Бобик', '2019-12-15', 1),
('Тобик', '2021-08-25', 1),
('Сонька', '2018-03-15', 2),
('Виска', '2019-01-25', 2),
('Лизка', '2015-11-05', 2),
('Хома1','2019-01-05', 3),
('Хома2','2021-12-25', 3),
('Хома3','2018-11-05', 3),
('Лошадь1','2021-06-26', 4),
('Лошадь2','2022-09-23', 4),
('Лошадь3','2023-11-19', 4),
('Веблюд1','2022-11-19', 5),
('Верблюд2','2019-12-01', 5),
('Верблюд3','2015-12-01', 5),
('Осел1','2014-09-27', 6),
('Осел2','2016-10-12', 6),
('Осел3','2019-12-19', 6);

insert into all_commands (name) 
values
('Фас'),
('К ноге'),
('Кис кис'),
('Мууур'),
('Команда хомяку1'),
('Команда хомяку2'),
('Команда лошади1'),
('Команда лошади2'),
('Команда верблюду1'),
('Команда верблюду2'),
('Команда ослу1'),
('Команда ослу2');

insert into animals_commands (all_animals_id, all_commands_id)
values
(1,1),
(1,2),
(2,1),
(3,2),
(4,3),
(4,4),
(5,3),
(6,4),
(7,5),
(7,6),
(8,5),
(9,6),
(10,7),
(10,8),
(11,7),
(12,8),
(13,9),
(13,10),
(14,9),
(15,10),
(16,11),
(16,12),
(17,11),
(18,12);